Catalogs/QWEP_Аккаунты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>QWEP_Аккаунты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.QWEP_Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.QWEP_ФилиалыПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопПараметрыАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Промо</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Включен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Корзина</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>basketId</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>basketItemId</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>article</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>available</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>brand</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>title</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>priceTotal</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>warehouse</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/QWEP_Аккаунты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Активировать(Отказ)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("vid", Элементы.ПоставщикКод.ТекстРедактирования);
	СтруктураПараметров.Вставить("bid", Элементы.ФилиалКод.ТекстРедактирования);
	СтруктураПараметров.Вставить("login", Объект.Логин);
	СтруктураПараметров.Вставить("password", Объект.Пароль);
	СтруктураПараметров.Вставить("parameters", Объект.ДопПараметрыАвторизации);
	
	Код = QWEP_Клиент.ПолучитьКодАктивированногоАккаунта(СтруктураПараметров);
	Если НЕ ЗначениеЗаполнено(Код) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Объект.Код = Код;
	Объект.Включен = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЭтоНовый Тогда
		Активировать(Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикФилиалПриИзменении(Элемент)
	
	Объект.Наименование = Строка(Объект.Поставщик) + Строка(Объект.Филиал);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовый = НЕ ЗначениеЗаполнено(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКорзину(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("accountId", Объект.Код);
	ОбъектКорзина = QWEP_Клиент.ПолучитьКорзинуАккаунта(СтруктураПараметров);
	
	ОбновитьДанныеКорзины(ОбъектКорзина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеКорзины(ОбъектКорзина)

	Объект.Корзина.Очистить();
	Элементы.ТекущаяКорзина.СписокВыбора.Очистить();
	Корзины = QWEP_Клиент.ПолучитьЗначениеСвойстваОбъектаСтруктуры(ОбъектКорзина, "entity.baskets");
	Если Корзины = Неопределено Тогда
	    Возврат;
	КонецЕсли;
	ВсегоКорзин = Корзины.Количество();
	ПНКорзины = 0;
	Для каждого Корзина Из Корзины Цикл
		ПНКорзины = ПНКорзины + 1;
		Элементы.ТекущаяКорзина.СписокВыбора.Добавить(Корзина.basketId, "Корзина " + ПНКорзины + " из " + ВсегоКорзин);
		ТекущаяКорзина = Корзина.basketId;
		Для каждого СтрокаКорзины Из Корзина.basketItems Цикл
			НоваяСтрока = Объект.Корзина.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКорзины);
			НоваяСтрока.basketId = Корзина.basketId;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ОчиститьКорзину(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("accountId", Объект.Код);
	СтруктураПараметров.Вставить("basketId", ТекущаяКорзина);
	ОбъектКорзина = QWEP_Клиент.ОчиститьКорзинуАккаунта(СтруктураПараметров);
	
	ОбновитьДанныеКорзины(ОбъектКорзина);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуКорзины(Команда)
	
	ТекСтрока = Элементы.Корзина.ТекущиеДанные;
	Если Элементы.Корзина.ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("accountId", Объект.Код);
	СтруктураПараметров.Вставить("basketId", ТекущаяКорзина);
	СтруктураПараметров.Вставить("basketItemId", ТекСтрока.basketItemId);
	ОбъектКорзина = QWEP_Клиент.УдалитьСтрокуКорзиныАккаунта(СтруктураПараметров);
	
	ОбновитьДанныеКорзины(ОбъектКорзина);
	
КонецПроцедуры


&НаКлиенте
Процедура КорзинаquantityПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Корзина.ТекущиеДанные;
	Если Элементы.Корзина.ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("accountId", Объект.Код);
	СтруктураПараметров.Вставить("basketId", ТекущаяКорзина);
	СтруктураПараметров.Вставить("basketItemId", ТекСтрока.basketItemId);
	СтруктураПараметров.Вставить("quantity", ТекСтрока.quantity);
	ОбъектКорзина = QWEP_Клиент.ИзменитьКоличествоПоСтрокеКорзины(СтруктураПараметров);
	
	ОбновитьДанныеКорзины(ОбъектКорзина);
	
КонецПроцедуры
